app/controllers/locations_controller.rb

  def create
    location = Location.new(
                            neighborhood: params[:neighborhood],
                            city: params[:city],
                            state: params[:state],
                            latitude: params[:latitude],
                            longitude: params[:longitude],
                            address: params[:address]
      )

    if location.save
---
INSERT INTO "locations" ("neighborhood", "city", "state", "latitude", "longitude", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"