app/controllers/photos_controller.rb

INSERT INTO "photos" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "photo1"], ["created_at", "2015-07-01 16:19:50.044874"], ["updated_at", "2015-07-01 16:19:50.044874"]]
---
  def create
    photo = Photo.new(url: params[:photoAddress])
    p "***********************address: #{params[:photoAddress]} ******************************"
    if photo.save