app/controllers/steps_controller.rb

SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", nil]]
SELECT COUNT(*) FROM "steps" WHERE "steps"."tour_id" = $1  [["tour_id", 12]]
---
  def new
    @user = current_user
    @tour = Tour.find(params[:tour_id])
    @step_number = @tour.steps.count + 1

SELECT  "tours".* FROM "tours" WHERE "tours"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(1) FROM "steps" WHERE "steps"."tour_id" = $1  [["tour_id", 2]]
INSERT INTO "steps" ("tour_id", "text", "number", "photo_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["tour_id", 2], ["text", "hhh"], ["number", 0], ["photo_id", 3], ["location_id", 3], ["created_at", "2015-07-01 19:05:40.432621"], ["updated_at", "2015-07-01 19:05:40.432621"]]
---
  def create
    tour = Tour.find(params[:tour_id])
    number_of_steps = tour.steps.count

    step = Step.new(
                    tour_id: tour.id,
                    text: params[:text],
                    number: ( number_of_steps + 1),
                    photo_id: session[:photo_id],
                    location_id: session[:location_id]
      )

    if step.save