app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours"
---
  def index
    @tours = Tour.all

INSERT INTO "tours" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asdf"], ["description", "asdgads"], ["created_at", "2015-06-30 22:28:47.671232"], ["updated_at", "2015-06-30 22:28:47.671232"]]
---
  def create

    @tour = Tour.new(name: params[:tour][:name], local_id: current_user.id, description: params[:tour][:description], photo_url: params[:tour][:photo_url])

    if @tour.save