app/controllers/users_controller.rb

SELECT "tours".* FROM "tours"
---
  def show
    @user = current_user
    @tours = Tour.all